Repository: sesebaby/Hermes-Desktop
Catalog: Desktop/HermesDesktop/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# WindowTitle
source: Hermes Desktop
zh_cn: Hermes 桌面

# ChatHeaderTitle.Text
source: Hermes Chat
zh_cn: Hermes 聊天

# ChatHeaderStatusFormat
source: {0} to {1}
zh_cn: {0} 至 {1}

# ChatConversationTitle.Text
source: Conversation
zh_cn: 对话

# ChatNewChatButton.Content
source: New Chat
zh_cn: 新对话

# ChatNewChatButton.AutomationProperties.Name
source: Start a fresh Hermes desktop conversation
zh_cn: 开始新的 Hermes 桌面会话

# ChatSessionNew
source: New conversation. Session continuity starts with your first message.
zh_cn: 新对话。会话连续性从您的第一条消息开始。

# ChatSessionExistingFormat
source: Continuing Hermes session {0}
zh_cn: 正在继续 Hermes 会话 {0}

# ChatInputBox.PlaceholderText
source: Ask Hermes to do something. Press Ctrl+Enter to send.
zh_cn: 请向 Hermes 下达任务。按 Ctrl+Enter 发送。

# ChatSendButton.Content
source: Send
zh_cn: 发送

# ChatSendButton.AutomationProperties.Name
source: Send the current message
zh_cn: 发送当前消息

# ChatInitialAssistantMessage
source: Ready. Type a message or /help for commands.
zh_cn: 就绪。输入消息或 /help 查看命令。

# ChatComposerHint
source: Desktop chat is ready.
zh_cn: 桌面聊天已就绪。

# ChatComposerReady
source: Ready for the next message.
zh_cn: 可以发送下一条消息。

# ChatComposerWaiting
source: Hermes is thinking...
zh_cn: Hermes 正在思考…

# ChatComposerOffline
source: Hermes is unavailable right now.
zh_cn: Hermes 当前不可用。

# ChatStatusChecking
source: Checking connection...
zh_cn: 正在检查连接…

# ChatErrorMessageFormat
source: The Hermes request failed: {0}
zh_cn: Hermes 请求失败：{0}

# ChatUserLabel
source: You
zh_cn: 您

# ChatSystemLabel
source: System
zh_cn: 系统

# ChatInspectorTabSession.Text
source: Session
zh_cn: 会话

# ChatInspectorTabContext.Text
source: Context
zh_cn: 上下文

# ChatInspectorTabFiles.Text
source: Files
zh_cn: 文件

# ChatInspectorSessionTitle.Text
source: Active session
zh_cn: 活动会话

# ChatInspectorModelTitle.Text
source: Model context
zh_cn: 模型上下文

# ChatInspectorWorkspaceTitle.Text
source: Workspace
zh_cn: 工作区

# ChatInspectorSessionEmpty
source: No active Hermes session yet.
zh_cn: 尚无活动的 Hermes 会话。

# ChatInspectorMessageCountFormat
source: {0} messages in this desktop thread.
zh_cn: 此桌面线程中有 {0} 条消息。

# ChatInspectorOpenWorkspaceButton.Content
source: Open workspace
zh_cn: 打开工作区

# ChatInspectorOpenLogsButton.Content
source: Open logs
zh_cn: 打开日志

# ChatInspectorOpenConfigButton.Content
source: Open config
zh_cn: 打开配置

# ShellNavigation.PaneTitle
source: Hermes Desktop
zh_cn: Hermes 桌面

# DashboardNavItem.Content
source: Overview
zh_cn: 概览

# ChatNavItem.Content
source: Chat
zh_cn: 聊天

# AgentNavItem.Content
source: Agent
zh_cn: 智能体

# DeveloperNavItem.Content
source: Developer
zh_cn: 开发者

# DeveloperNavItem.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Open the developer page
zh_cn: 打开开发者页面

# SkillsNavItem.Content
source: Skills
zh_cn: 技能

# MemoryNavItem.Content
source: Memory
zh_cn: 记忆

# SettingsNavItem.Content
source: Settings
zh_cn: 设置

# DashboardHeroEyebrow.Text
source: Native control room
zh_cn: 原生控制室

# DashboardHeroTitle.Text
source: Keep Hermes, local models, and messaging in one desktop shell.
zh_cn: 将 Hermes、本地模型与消息收发统一在一个桌面外壳中。

# DashboardHeroSubtitle.Text
source: This first pass gives you a Windows-native workspace around the agent you already installed, with quick launch points for the CLI, config, logs, and bot integrations.
zh_cn: 第一版在您已安装的智能体周围提供 Windows 原生工作区，可快速打开 CLI、配置、日志与机器人集成。

# DashboardLaunchChatButton.Content
source: Launch CLI
zh_cn: 启动 CLI

# DashboardLaunchChatButton.AutomationProperties.Name
source: Launch Hermes CLI
zh_cn: 启动 Hermes CLI

# DashboardOpenLogsButton.Content
source: Open logs
zh_cn: 打开日志

# DashboardOpenLogsButton.AutomationProperties.Name
source: Open Hermes logs folder
zh_cn: 打开 Hermes 日志文件夹

# DashboardOpenConfigButton.Content
source: Open config
zh_cn: 打开配置

# DashboardOpenConfigButton.AutomationProperties.Name
source: Open Hermes config file
zh_cn: 打开 Hermes 配置文件

# DashboardProviderLabel.Text
source: Provider
zh_cn: 提供商

# DashboardModelLabel.Text
source: Default model
zh_cn: 默认模型

# DashboardPathsSectionTitle.Text
source: Live paths
zh_cn: 实时路径

# DashboardHermesHomeLabel.Text
source: Hermes home
zh_cn: Hermes 主目录

# DashboardConfigLabel.Text
source: Config file
zh_cn: 配置文件

# DashboardLogsLabel.Text
source: Logs folder
zh_cn: 日志文件夹

# DashboardWorkspaceLabel.Text
source: Agent repo
zh_cn: 智能体仓库

# DashboardStatusSectionTitle.Text
source: Current runtime
zh_cn: 当前运行时

# DashboardEndpointLabel.Text
source: Base URL
zh_cn: 基础 URL

# DashboardPortLabel.Text
source: Port
zh_cn: 端口

# DashboardQuickNotesTitle.Text
source: What this shell is for
zh_cn: 此外壳的用途

# DashboardQuickNotesLine1.Text
source: Launch the agent fast without reopening setup scripts.
zh_cn: 无需重新打开安装脚本即可快速启动智能体。

# DashboardQuickNotesLine2.Text
source: Check the active model target and bot readiness at a glance.
zh_cn: 一眼查看当前模型目标与机器人就绪状态。

# DashboardQuickNotesLine3.Text
source: Keep a Windows-native control surface separate from OpenClaw.
zh_cn: 将 Windows 原生控制界面与 OpenClaw 分开维护。

# ChatPageEyebrow.Text
source: Chat surface
zh_cn: 聊天界面

# ChatPageTitle.Text
source: Talk to your configured local model right inside the desktop shell.
zh_cn: 在桌面外壳内直接与已配置的本地模型对话。

# ChatPageSubtitle.Text
source: This desktop view uses the same configured model endpoint as Hermes. Keep the CLI button around for the full tool-heavy agent loop while we bring more of that flow into the app.
zh_cn: 此桌面视图使用与 Hermes 相同的已配置模型端点。在将更多流程迁入应用的同时，可继续使用左侧 CLI 按钮获得完整工具链智能体循环。

# ChatLaunchButton.Content
source: Launch Hermes chat
zh_cn: 启动 Hermes 聊天

# ChatLaunchButton.AutomationProperties.Name
source: Launch Hermes chat from the desktop shell
zh_cn: 从桌面外壳启动 Hermes 聊天

# ChatConfigButton.Content
source: Open config
zh_cn: 打开配置

# ChatConfigButton.AutomationProperties.Name
source: Open Hermes config from the chat page
zh_cn: 从聊天页打开 Hermes 配置

# ChatSessionsTitle.Text
source: Recent session ideas
zh_cn: 近期会话示例

# ChatSessionsItem1Header.Text
source: Local agent work
zh_cn: 本地智能体工作

# ChatSessionsItem1Body.Text
source: Run coding and ops tasks against the local model endpoint you already verified.
zh_cn: 针对您已验证的本地模型端点运行编码与运维任务。

# ChatSessionsItem3Header.Text
source: Desktop-first workflows
zh_cn: 桌面优先工作流

# ChatSessionsItem3Body.Text
source: Use this shell as the operational hub and drop into the CLI only when you want full agent control.
zh_cn: 将此外壳作为运维中心，仅在需要完整智能体控制时再进入 CLI。

# ChatWorkspaceTitle.Text
source: Planned desktop flow
zh_cn: 规划中的桌面流程

# ChatWorkspaceLine1.Text
source: Native conversation list on the left.
zh_cn: 左侧为原生对话列表。

# ChatWorkspaceLine2.Text
source: Task and tool activity on the right.
zh_cn: 右侧为任务与工具活动。

# ChatWorkspaceLine3.Text
source: Quick jump into Hermes chat whenever you want the raw agent loop.
zh_cn: 需要原始智能体循环时可随时跳入 Hermes 聊天。

# ChatComposerLabel.Text
source: Desktop composer preview
zh_cn: 桌面撰写区预览

# ChatComposerTextBox.PlaceholderText
source: Native message composer and task queue will land here next.
zh_cn: 原生消息撰写区与任务队列将随后提供。

# SettingsEyebrow.Text
source: Local setup
zh_cn: 本地设置

# SettingsTitle.Text
source: These are the runtime values the desktop shell is reading right now.
zh_cn: 以下为桌面外壳当前读取的运行时值。

# SettingsSubtitle.Text
source: The settings page is where model selection, agent behavior, memory, Dreamer, plugins, and display preferences live.
zh_cn: 设置页承载模型选择、智能体行为、记忆、Dreamer、插件与显示偏好。

# SettingsRuntimeTitle.Text
source: Model and runtime
zh_cn: 模型与运行时

# SettingsProviderLabel.Text
source: Provider
zh_cn: 提供商

# SettingsBaseUrlLabel.Text
source: Base URL
zh_cn: 基础 URL

# SettingsModelLabel.Text
source: Default model
zh_cn: 默认模型

# SettingsPathsTitle.Text
source: Files and folders
zh_cn: 文件与文件夹

# SettingsHomeButton.Content
source: Open Hermes home
zh_cn: 打开 Hermes 主目录

# SettingsHomeButton.AutomationProperties.Name
source: Open Hermes home folder
zh_cn: 打开 Hermes 主目录文件夹

# SettingsConfigButton.Content
source: Open config
zh_cn: 打开配置

# SettingsConfigButton.AutomationProperties.Name
source: Open Hermes config file from settings
zh_cn: 从设置打开 Hermes 配置文件

# SettingsLogsButton.Content
source: Open logs
zh_cn: 打开日志

# SettingsLogsButton.AutomationProperties.Name
source: Open Hermes logs folder from settings
zh_cn: 从设置打开 Hermes 日志文件夹

# SettingsWorkspaceButton.Content
source: Open agent repo
zh_cn: 打开智能体仓库

# SettingsWorkspaceButton.AutomationProperties.Name
source: Open the Hermes agent repo from settings
zh_cn: 从设置打开 Hermes 智能体仓库

# StatusInstalled
source: Installed
zh_cn: 已安装

# StatusMissing
source: Missing
zh_cn: 缺失

# StatusConfigured
source: Configured
zh_cn: 已配置

# StatusNeedsSetup
source: Needs setup
zh_cn: 需要设置

# StatusReady
source: Ready
zh_cn: 就绪

# StatusConnected
source: Connected
zh_cn: 已连接

# StatusOffline
source: Offline
zh_cn: 离线

# StatusDetected
source: Detected
zh_cn: 已检测到

# StatusNotDetected
source: Not detected
zh_cn: 未检测到

# CliReadySummary
source: Native install detected
zh_cn: 已检测到原生安装

# CliMissingSummary
source: Install not found
zh_cn: 未找到安装

# ChatConnectionCardTitle.Text
source: Live endpoint
zh_cn: 实时端点

# ChatRuntimeTitle.Text
source: Runtime details
zh_cn: 运行时详情

# ChatConnectionStatusLabel.Text
source: Status
zh_cn: 状态

# ChatConnectionEndpointLabel.Text
source: Endpoint
zh_cn: 端点

# ChatConnectionProviderLabel.Text
source: Provider
zh_cn: 提供商

# ChatConnectionModelLabel.Text
source: Model
zh_cn: 模型

# ChatRefreshButton.Content
source: Refresh
zh_cn: 刷新

# ChatRefreshButton.AutomationProperties.Name
source: Refresh the model endpoint status
zh_cn: 刷新模型端点状态

# ChatOpenConfigButton.Content
source: Open config
zh_cn: 打开配置

# ChatOpenConfigButton.AutomationProperties.Name
source: Open the Hermes config file from the desktop chat page
zh_cn: 从桌面聊天页打开 Hermes 配置文件

# ChatGuideTitle.Text
source: How to use this view
zh_cn: 如何使用此视图

# ChatGuideLine1.Text
source: Use this page for normal back-and-forth model chat inside the app.
zh_cn: 在此页面进行应用内的常规模型对话。

# ChatGuideLine2.Text
source: The runtime card shows the exact endpoint, provider, and model the page is using.
zh_cn: 运行时卡片显示本页使用的端点、提供商与模型。

# ChatConversationSubtitle.Text
source: Messages stay in this desktop session until you clear them.
zh_cn: 在您清除之前，消息将保留在此桌面会话中。

# ChatInputLabel.Text
source: Message
zh_cn: 消息

# ChatClearButton.Content
source: Clear
zh_cn: 清除

# ChatClearButton.AutomationProperties.Name
source: Clear the desktop chat conversation
zh_cn: 清除桌面聊天对话

# ChatPageAgentTitle.Text
source: Hermes Agent
zh_cn: Hermes 智能体

# ChatReasoningHeaderLabel.Text
source: Reasoning
zh_cn: 推理

# ChatPageThinkingText.Text
source: Hermes is thinking...
zh_cn: Hermes 正在思考…

# ChatStopButton.Content
source: Stop
zh_cn: 停止

# ChatPromptTextBox.PlaceholderText
source: Message Hermes...
zh_cn: 向 Hermes 发送消息…

# ChatPageSendButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Send message
zh_cn: 发送消息

# ChatPermissionModeLabel.Text
source: Default mode
zh_cn: 默认模式

# ChatPermissionModeChange.Content
source: change
zh_cn: 更改

# ChatPermissionModeClearWorkspacePermissions
source: Clear workspace permissions
zh_cn: 清除此工作区的记忆权限

# ChatPermissionModeClearWorkspacePermissionsConfirm
source: Workspace permissions cleared.
zh_cn: 已清除此工作区的记忆权限。

# ChatPageDisclaimer.Text
source: Hermes can make mistakes. Verify important information.
zh_cn: Hermes 可能出错。重要信息请自行核实。

# ChatPageTabSessions.Content
source: Sessions
zh_cn: 会话

# ChatPageTabFiles.Content
source: Files
zh_cn: 文件

# ChatPageTabTasks.Content
source: Tasks
zh_cn: 任务

# ChatPageTabReplay.Content
source: Replay
zh_cn: 回放

# ChatCopySessionIdButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Copy session ID
zh_cn: 复制会话 ID

source: Copy session ID
zh_cn: 复制会话 ID

# ChatSessionFooterNew
source: New Session
zh_cn: 新会话

# ChatSessionFooterFormat
source: Session: {0}
zh_cn: 会话：{0}

# ChatThinkingShort
source: Hermes is thinking
zh_cn: Hermes 正在思考

# ChatThinkingRunningSkill
source: Running skill...
zh_cn: 正在运行技能…

# ChatThinkingLineThinking
source: Hermes is thinking
zh_cn: Hermes 正在思考

# ChatThinkingLineReasoning
source: Hermes is reasoning
zh_cn: Hermes 正在推理

# ChatPermissionModeFormat
source: {0} mode
zh_cn: {0} 模式

# ChatPermissionModeNameDefault
source: Default
zh_cn: 默认

# ChatPermissionModeNamePlan
source: Plan
zh_cn: 计划

# ChatPermissionModeNameAuto
source: Auto
zh_cn: 自动

# ChatPermissionModeNameAcceptEdits
source: Accept Edits
zh_cn: 接受编辑

# ChatPermissionModeNameBypass
source: Bypass
zh_cn: 绕过

# ChatPermissionClearRemembered
source: Clear remembered tool permissions (workspace)
zh_cn: 清除此工作区的记忆工具权限

# ChatPermissionRememberedCleared
source: Cleared remembered tool permissions for this workspace.
zh_cn: 已清除此工作区的记忆工具权限。

# ChatPermissionRememberedClearFailed
source: Could not clear remembered workspace tool permissions.
zh_cn: 无法清除此工作区的记忆工具权限。

# DashOverviewKpiSessionsTitle.Text
source: Sessions
zh_cn: 会话

# DashOverviewKpiSessionsSub.Text
source: total conversations
zh_cn: 总会话数

# DashOverviewKpiToolsTitle.Text
source: Tools
zh_cn: 工具

# DashOverviewKpiToolsSub.Text
source: registered
zh_cn: 已注册

# DashOverviewKpiSkillsTitle.Text
source: Skills
zh_cn: 技能

# DashOverviewKpiSkillsSub.Text
source: available
zh_cn: 可用

# DashOverviewKpiLlmTitle.Text
source: LLM Status
zh_cn: 大模型状态

# DashOverviewLlmStatusInitial.Text
source: Checking...
zh_cn: 正在检查…

# DashDreamerPhaseInitial.Text
source: Phase: —
zh_cn: 阶段：—

# DashDreamerWalksInitial.Text
source: Walks: —
zh_cn: 游走次数：—

# DashDreamerSignalInitial.Text
source: Top signal: —
zh_cn: 主要信号：—

# DashDreamerLocalDigestInitial.Text
source: Local digest: —
zh_cn: 本地摘要：—

# DashDreamerPostcardInitial.Text
source: Digest preview: --
zh_cn: 摘要预览：--

# DashPlatformsServices.Text
source: Services
zh_cn: 服务

# DashModelCardTitle.Text
source: Model Configuration
zh_cn: 模型配置

# DashOverviewEndpointField.Text
source: Endpoint
zh_cn: 端点

# DashTestConnectionButton.Content
source: Test Connection
zh_cn: 测试连接

# DashRecentActivityTitle.Text
source: Recent Activity
zh_cn: 最近活动

# DashOpenChatButton.Content
source: Open Chat
zh_cn: 打开聊天

# DashNoSessionsText.Text
source: No sessions yet. Start a conversation in Chat.
zh_cn: 尚无会话。请在聊天中开始对话。

# DashSystemCardTitle.Text
source: System
zh_cn: 系统

# DashSystemSoulsLabel.Text
source: Souls
zh_cn: 灵魂

# DashOpenLogsSmallButton.Content
source: Open Logs
zh_cn: 打开日志

# DashOpenConfigSmallButton.Content
source: Open Config
zh_cn: 打开配置

# DashInsightsTitle.Text
source: Usage Insights
zh_cn: 使用洞察

# DashInsightsTotalTurns.Text
source: Total Turns
zh_cn: 总轮次

# DashInsightsToolCalls.Text
source: Tool Calls
zh_cn: 工具调用

# DashInsightsEstCost.Text
source: Est. Cost
zh_cn: 预估费用

# DashInsightsTopTools.Text
source: Top Tools
zh_cn: 常用工具

# BadgeMemory
source: Memory
zh_cn: 记忆

# BadgeSkills
source: Skills
zh_cn: 技能

# BadgeDream
source: Dream
zh_cn: 梦境

# BadgeSoul
source: Soul
zh_cn: 灵魂

# DashboardDreamerPhaseFormat
source: Phase: {0}
zh_cn: 阶段：{0}

# DashboardDreamerWalksFormat
source: Walks: {0}
zh_cn: 游走次数：{0}

# DashboardDreamerTopSignalEmpty
source: Top signal: —
zh_cn: 主要信号：—

# DashboardDreamerTopSignalFormat
source: Top signal: {0} ({1:F1})
zh_cn: 主要信号：{0}（{1:F1}）

# DashboardDreamerStartupIssueFormat
source: Startup issue: {0}
zh_cn: 启动问题：{0}

# DashboardDreamerLocalDigestEmpty
source: Local digest: —
zh_cn: 本地摘要：—

# DashboardDreamerLocalDigestFormat
source: Local digest: {0}
zh_cn: 本地摘要：{0}

# DashboardDreamerPostcardEmpty
source: Digest preview: --
zh_cn: 摘要预览：--

# DashboardTimeAgoNow
source: now
zh_cn: 刚刚

# DashboardTimeAgoMinutesFormat
source: {0}m
zh_cn: {0} 分钟

# DashboardTimeAgoHoursFormat
source: {0}h
zh_cn: {0} 小时

# DashboardTimeAgoDaysFormat
source: {0}d
zh_cn: {0} 天

# DashboardSessionMessageCountFormat
source: {0} msgs
zh_cn: {0} 条消息

# DashboardSessionNoMessages
source: (no messages)
zh_cn: （无消息）

# DashboardTopToolLineFormat
source: {0}: {1} calls • {2} ms avg
zh_cn: {0}：{1} 次调用 · 平均 {2} 毫秒

# DashboardTestTesting
source: Testing...
zh_cn: 正在测试…

# DashboardTestNotConfigured
source: Not configured
zh_cn: 未配置

# DashboardTestSuccessFormat
source: Connected — {0}
zh_cn: 已连接 — {0}

# DashboardTestFailedFormat
source: Failed: {0}
zh_cn: 失败：{0}

# DashboardSoulDefaultProfile
source: Default
zh_cn: 默认

# SettingsPageEyebrow.Text
source: SETTINGS
zh_cn: 设置

# SettingsPageTitle.Text
source: Configuration
zh_cn: 配置

# SettingsPageSubtitle.Text
source: Configure model, agent behavior, memory, Dreamer, plugins, and display preferences.
zh_cn: 配置模型、智能体行为、记忆、Dreamer、插件与显示偏好。

# SettingsExpUserProfileHeader.Text
source: User Profile
zh_cn: 用户资料

# SettingsUserProfileIntro.Text
source: This information helps the agent personalize responses and remember who you are across sessions. Stored in USER.md.
zh_cn: 这些信息帮助代理个性化回复并在会话间记住您。存储在 USER.md 中。

# SettingsLblYourName.Text
source: YOUR NAME
zh_cn: 您的姓名

# SettingsUserNameBox.PlaceholderText
source: How should the agent address you?
zh_cn: 希望代理如何称呼您？

# SettingsLblRoleExpertise.Text
source: ROLE / EXPERTISE
zh_cn: 角色 / 专长

# SettingsUserRoleBox.PlaceholderText
source: e.g. Windows developer, data scientist, student...
zh_cn: 例如：Windows 开发者、数据科学家、学生…

# SettingsLblWorkingStyle.Text
source: WORKING STYLE
zh_cn: 工作风格

# SettingsUserStyleBox.PlaceholderText
source: e.g. Prefers concise responses, likes code over explanations...
zh_cn: 例如：偏好简洁回答、更喜欢代码而非长文解释…

# SettingsLblDefaultProjectDir.Text
source: DEFAULT PROJECT DIRECTORY
zh_cn: 默认项目目录

# SettingsUserProjectDirBox.PlaceholderText
source: e.g. C:\Projects or ~/code
zh_cn: 例如 C:\Projects 或 ~/code

# SettingsBrowseProjectDirBtn.Content
source: Browse
zh_cn: 浏览

# SettingsSaveUserProfileBtn.Content
source: Save Profile
zh_cn: 保存资料

# SettingsEditUserMdBtn.Content
source: Edit USER.md
zh_cn: 编辑 USER.md

# SettingsExpModelConfigHeader.Text
source: Model Configuration
zh_cn: 模型配置

# SettingsLblProvider.Text
source: PROVIDER
zh_cn: 提供商

# SettingsProvQwen.Content
source: Qwen (Alibaba)
zh_cn: 通义千问（阿里）

# SettingsProvLocal.Content
source: Custom / Local
zh_cn: 自定义 / 本地

# SettingsLblBaseUrl.Text
source: BASE URL
zh_cn: 基础 URL

# SettingsLblModel.Text
source: MODEL
zh_cn: 模型

# SettingsModelBox.PlaceholderText
source: Or type a custom model ID
zh_cn: 或输入自定义模型 ID

# SettingsContextLengthLabel.Text
source: Context: --
zh_cn: 上下文：--

# SettingsLblApiKey.Text
source: API KEY
zh_cn: API 密钥

# SettingsApiKeyBox.PlaceholderText
source: sk-... (leave blank for local)
zh_cn: sk-…（本地可留空）

# SettingsLblAuthMode.Text
source: AUTH MODE
zh_cn: 认证模式

# SettingsAuthApiKey.Content
source: API Key
zh_cn: API 密钥

# SettingsAuthApiKeyEnv.Content
source: API Key (Env Var)
zh_cn: API 密钥（环境变量）

# SettingsAuthOAuthEnv.Content
source: OAuth Proxy (Env Token)
zh_cn: OAuth 代理（环境令牌）

# SettingsAuthOAuthCmd.Content
source: OAuth Proxy (Command Token)
zh_cn: OAuth 代理（命令令牌）

# SettingsAuthNone.Content
source: No Auth Header
zh_cn: 无认证头

# SettingsLblApiKeyEnvVar.Text
source: API KEY ENV VAR
zh_cn: API 密钥环境变量

# SettingsLblAuthHeader.Text
source: AUTH HEADER
zh_cn: 认证头

# SettingsLblAuthScheme.Text
source: AUTH SCHEME
zh_cn: 认证方案

# SettingsLblTokenEnvVar.Text
source: TOKEN ENV VAR
zh_cn: 令牌环境变量

# SettingsLblTokenCommand.Text
source: TOKEN COMMAND
zh_cn: 令牌命令

# SettingsOAuthHelpText.Text
source: OAuth proxy modes let Hermes fetch a short-lived token from an environment variable or refresh command and attach it to an OpenAI-compatible proxy request.
zh_cn: OAuth 代理模式让 Hermes 从环境变量或刷新命令获取短期令牌，并附加到兼容 OpenAI 的代理请求。

# SettingsLblTemperature.Text
source: TEMPERATURE
zh_cn: 温度

# SettingsLblMaxTokens.Text
source: MAX TOKENS
zh_cn: 最大令牌数

# SettingsSaveModelBtn.Content
source: Save Model Config
zh_cn: 保存模型配置

# SettingsRuntimeStatusHeader.Text
source: CURRENT RUNTIME STATUS
zh_cn: 当前运行状态

# SettingsRuntimeProviderRow.Text
source: Provider
zh_cn: 提供商

# SettingsRuntimeModelRow.Text
source: Model
zh_cn: 模型

# SettingsRuntimeConnectionRow.Text
source: Connection
zh_cn: 连接

# SettingsExpAgentBehaviorHeader.Text
source: Agent Behavior
zh_cn: 代理行为

# SettingsLblMaxTurns.Text
source: MAX TURNS
zh_cn: 最大轮次

# SettingsLblToolUse.Text
source: TOOL USE ENFORCEMENT
zh_cn: 工具使用策略

# SettingsToolUseAuto.Content
source: Auto
zh_cn: 自动

# SettingsToolUseAlways.Content
source: Always
zh_cn: 始终

# SettingsToolUseNever.Content
source: Never
zh_cn: 从不

# SettingsLblApprovalsMode.Text
source: APPROVALS MODE
zh_cn: 审批模式

# SettingsApprovalsManual.Content
source: Manual
zh_cn: 手动

# SettingsApprovalsSmart.Content
source: Smart
zh_cn: 智能

# SettingsApprovalsOff.Content
source: Off
zh_cn: 关闭

# SettingsLblApprovalTimeout.Text
source: APPROVAL TIMEOUT (SECONDS)
zh_cn: 审批超时（秒）

# SettingsSaveAgentBtn.Content
source: Save Agent Config
zh_cn: 保存代理配置

# SettingsExpMemoryContextHeader.Text
source: Memory & Context
zh_cn: 记忆与上下文

# SettingsLblMemoryEnabled.Text
source: Memory Enabled
zh_cn: 启用记忆

# SettingsLblUserProfileEnabled.Text
source: User Profile Enabled
zh_cn: 启用用户资料

# SettingsLblMemoryCharLimit.Text
source: MEMORY CHAR LIMIT
zh_cn: 记忆字符上限

# SettingsLblUserCharLimit.Text
source: USER CHAR LIMIT
zh_cn: 用户字符上限

# SettingsLblCompressionEnabled.Text
source: Compression Enabled
zh_cn: 启用压缩

# SettingsLblCompressionThreshold.Text
source: COMPRESSION THRESHOLD
zh_cn: 压缩阈值

# SettingsSaveMemoryBtn.Content
source: Save Memory Config
zh_cn: 保存记忆配置

# SettingsDreamerIntro.Text
source: Background free-association on a local model (Ollama). Off by default. Room: %LOCALAPPDATA%\hermes\dreamer\. Scheduled digests save under feedback\digests\.
zh_cn: 在本地模型（Ollama）上进行背景自由联想。默认关闭。目录：%LOCALAPPDATA%\hermes\dreamer\。定时摘要写入 feedback\digests\。

# SettingsDreamerEnabledLabel.Text
source: ENABLE DREAMER
zh_cn: 启用 Dreamer

# SettingsDreamerWalkIntervalLabel.Text
source: WALK INTERVAL (MINUTES)
zh_cn: 游走间隔（分钟）

# SettingsDreamerWalkModelLabel.Text
source: WALK MODEL
zh_cn: 游走模型

# SettingsDreamerWalkBaseUrlLabel.Text
source: WALK BASE URL
zh_cn: 游走基础 URL

# SettingsDreamerDigestTimesLabel.Text
source: DIGEST TIMES (LOCAL)
zh_cn: 摘要时间（本地）

# SettingsDreamerTriggerThresholdLabel.Text
source: SIGNAL SCORE TO TRIGGER BUILD
zh_cn: 触发构建的信号分数阈值

# SettingsDreamerMinWalksLabel.Text
source: MIN WALKS BEFORE BUILD
zh_cn: 触发前最少游走次数

# SettingsSaveDreamerBtn.Content
source: Save Dreamer Config
zh_cn: 保存 Dreamer 配置

# SettingsOpenDreamerRoomBtn.Content
source: Open Dreamer Room
zh_cn: 打开 Dreamer 目录

source: Dreamer save status
zh_cn: Dreamer 保存状态

# SettingsExpDisplayPrivacyHeader.Text
source: Display & Privacy
zh_cn: 显示与隐私

# SettingsLblShowReasoning.Text
source: Show Reasoning
zh_cn: 显示推理

# SettingsLblStreaming.Text
source: Streaming
zh_cn: 流式输出

# SettingsLblInlineDiffs.Text
source: Inline Diffs
zh_cn: 内联差异

# SettingsLblShowCost.Text
source: Show Cost
zh_cn: 显示费用

# SettingsLblRedactPii.Text
source: Redact PII
zh_cn: 屏蔽个人信息

# SettingsSaveDisplayBtn.Content
source: Save Display Config
zh_cn: 保存显示配置

# SettingsExpPluginsHeader.Text
source: Plugins & Extensions
zh_cn: 插件与扩展

# SettingsLblBuiltinMemoryPlugin.Text
source: Built-in Memory Plugin
zh_cn: 内置记忆插件

# SettingsLblExternalMemoryProvider.Text
source: EXTERNAL MEMORY PROVIDER
zh_cn: 外部记忆提供方

# SettingsExternalMemoryProviderBox.PlaceholderText
source: Leave empty for built-in only
zh_cn: 留空则仅使用内置

# SettingsSavePluginBtn.Content
source: Save Plugin Config
zh_cn: 保存插件配置

# SettingsExpPathsSystemHeader.Text
source: Paths & System
zh_cn: 路径与系统

# SettingsUserProfilePathFormat
source: Stored at: {0}
zh_cn: 存储位置：{0}

# SettingsProfileSaved
source: Profile saved.
zh_cn: 资料已保存。

# SettingsSaveSuccessRestart
source: Saved successfully. Restart to apply.
zh_cn: 保存成功。请重启以应用。

# SettingsDreamerSaved
source: Saved. Restart app to refresh Dreamer LLM clients.
zh_cn: 已保存。请重启应用以刷新 Dreamer 的 LLM 客户端。

# SettingsErrorFormat
source: Error: {0}
zh_cn: 错误：{0}

# SettingsModelRequired
source: Model name is required.
zh_cn: 必须填写模型名称。
